const minus = require("./minus.js");

// 2 - 1 เท่ากับ 1
test("2 - 1 เท่ากับ 1", () => {
  expect(minus(2, 1)).toBe(1);
});

// 3 - 5 เท่ากับ -2
test("3 - 5 เท่ากับ -2", () => {
  expect(minus(3, 5)).toBe(-2);
});

// -10 - 5 เท่ากับ -15
test("-10 - 5 เท่ากับ -15", () => {
  expect(minus(-10, 5)).toBe(-15);
});

// -20 - (-10) เท่ากับ -10
test("-20 - (-10) เท่ากับ -10", () => {
  expect(minus(-20, -10)).toBe(-10);
});

// 30 - (-10) เท่ากับ 40
test("30 - (-10) เท่ากับ 40", () => {
  expect(minus(30, -10)).toBe(40);
});
