const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ 7
test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

// 90 + 9 เท่ากับ 99
test('90 + 9 เท่ากับ 99', ()=> {
  expect(sum(90,9)).toBe(99);
});

// -10 + 20 เท่ากับ 10
test('-10 + 20 เท่ากับ 10', ()=> {
  expect(sum(-10,20)).toBe(10);
});

// -10 + -5 เท่ากับ -15
test('-10 + -5 เท่ากับ -15', ()=> {
  expect(sum(-10,-5)).toBe(-15);
});